# Sales Analysis
    1) Identify the states that are generating the highest revenues.,
    2) Develop sales programs for states with lower revenues. The head of sales and marketing has requested your assistance with this task.

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv("AusApparalSales4thQrt2020.csv")
data.head()

         Date        Time State     Group  Unit  Sales
0  1-Oct-2020     Morning    WA      Kids     8  20000
1  1-Oct-2020     Morning    WA       Men     8  20000
2  1-Oct-2020     Morning    WA     Women     4  10000
3  1-Oct-2020     Morning    WA   Seniors    15  37500
4  1-Oct-2020   Afternoon    WA      Kids     3   7500

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7560 entries, 0 to 7559
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    7560 non-null   object
 1   Time    7560 non-null   object
 2   State   7560 non-null   object
 3   Group   7560 non-null   object
 4   Unit    7560 non-null   int64
 5   Sales   7560 non-null   int64
dtypes: int64(2), object(4)
memory usage: 354.5+ KB

In [4]:
data.describe()

              Unit          Sales
count  7560.000000    7560.000000
mean     18.005423   45013.558201
std      12.901403   32253.506944
min       2.000000    5000.000000
25%       8.000000   20000.000000
50%      14.000000   35000.000000
75%      26.000000   65000.000000
max      65.000000  162500.000000

# 1.      Data wrangling
#### a.      Ensure that the data is clean and free from any missing or incorrect entries.
#####           Inspect the data manually to identify missing or incorrect information using the functions isna() and notna().
#### b.      Based on your knowledge of data analytics, include your recommendations for treating missing and incorrect data (dropping the null values or filling them).
#### c.      Choose a suitable data wrangling techniqueâ€”either data standardization or normalization. Execute the preferred normalization method and present the resulting data. (Normalization is the preferred approach for this problem.)
#### d.      Share your insights regarding the application of the GroupBy() function for either data chunking or merging, and offer a recommendation based on your analysis.

In [5]:
data.isnull().sum()

Date     0
Time     0
State    0
Group    0
Unit     0
Sales    0
dtype: int64

#### There are no missing values in any of the columns so no need to replace na/null by mean

In [6]:
data.isna().sum()

Date     0
Time     0
State    0
Group    0
Unit     0
Sales    0
dtype: int64

In [7]:
df = data.groupby(["Date","State","Time"]).sum()
df

                                              Group  Unit   Sales
Date       State Time
1-Dec-2020 NSW   Afternoon   Kids Men Women Seniors   135  337500
                 Evening     Kids Men Women Seniors   124  310000
                 Morning     Kids Men Women Seniors   116  290000
           NT    Afternoon   Kids Men Women Seniors    49  122500
                 Evening     Kids Men Women Seniors    41  102500
...                                             ...   ...     ...
9-Oct-2020 VIC   Evening     Kids Men Women Seniors   149  372500
                 Morning     Kids Men Women Seniors   167  417500
           WA    Afternoon   Kids Men Women Seniors    26   65000
                 Evening     Kids Men Women Seniors    34   85000
                 Morning     Kids Men Women Seniors    26   65000

[1890 rows x 3 columns]

In [16]:
import pandas as pd
import matplotlib.pyplot as plt
# Create DataFrame
df = pd.DataFrame(data)

# Combine 'Date' and 'Time' into a single 'Date Time' column
df['Date Time'] = df['Date'] + ' ' + df['Time']


grouped = df.groupby(['Time','State']).sum()

print(grouped.Sales)

Time       State
Afternoon  NSW      25110000
           NT        7510000
           QLD      11347500
           SA       20025000
           TAS       7670000
           VIC      35062500
           WA        7282500
Evening    NSW      24712500
           NT        7627500
           QLD      10632500
           SA       19367500
           TAS       7565000
           VIC      34880000
           WA        7302500
Morning    NSW      25147500
           NT        7442500
           QLD      11437500
           SA       19465000
           TAS       7525000
           VIC      35622500
           WA        7567500
Name: Sales, dtype: int64